AcString.releaseBuffer(System.Int32)
Use releaseBuffer() to end the use of a buffer allocated by the getBuffer() method.
The pointer returned by getBuffer() is invalid after the call to releaseBuffer().
nMinBufferLength: Sets the new length of the AcString.
If -1, then the string's length is determined by the null terminator's index.
Otherwise the new length is set to the minimum of nMinBufferLength and the null
terminator's index.
Returns: True if success, false on errors such as invalid length args or
no previous call to getBuffer().

AcString.insert(System.Int32,System.Char!System.Runtime.CompilerServices.IsConst*)
Inserts a substring at the given index within the string.
nIndex: The index of the character before which the insertion will take place.
ch: A pointer to the substring to be inserted.
Returns: A reference to this AcString object.

AcString.insert(System.Int32,System.Char)
Inserts a single character at the given index within the string.
nIndex: The index of the character before which the insertion will take place.
ch: The character to be inserted.
Returns: A reference to this AcString object.

AcString.getAt(System.Int32)
Get one character at the given postion from the string.
nIndex: Zero-based postion of character in the string.
Returns:  Return the character at the specified position in the string
Remarks:  Does NOT do range checking on the nIndex arg.
Results for out of range nIndex args are unpredictable.
Indexing via [] may also work, causing an implicit call to
the const wchar_t * operator

AcString.setAt(System.Int32,System.Char)
Set the character at the given postion to the specified character.
nIndex: Zero-based postion of character in the string.
ch: The new character to replace the old one.
Returns: A reference to this AcString object.

AcString.tokenize(System.Char!System.Runtime.CompilerServices.IsConst*,System.Int32*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Finds the next token in a target string
pszTokens: A string containing token delimiters.
The order of these delimiters is not important.
iStart: The zero-based index at which to begin the search.
Returns: An AcString containing the current token value.
Remarks:  Returned string does not contain the delimiter
iStart is updated to next position after the delimiter

AcString.truncate(System.Int32)
Truncates the string from the given index
nIndex:  Zero-based position at which to start deleting from
Returns: Return a reference to this string object.

AcString.deleteAtIndex(System.Int32,System.Int32)
Deletes character(s) from a string starting with the character at given index.
iIndex:  Zero-based position from which to start deleting
nCount:  character number to be deleted. If -1, delete to end
Returns: Return the length of the changed string.
Remarks:  Truncates the string if nCount is -1

AcString.replace(System.Char,System.Char)
Replace a character with another.
wchOld:  character that will be replaced
wchNew:  new character that will be replaced with
Returns: The number of replaced instances of the wchOld.
Zero if the string is not changed.

AcString.replace(System.Char!System.Runtime.CompilerServices.IsConst*,System.Char!System.Runtime.CompilerServices.IsConst*)
Rplaces instances of the substring with instances of the new string
pwszOld:  A pointer to a string containing the character to be replaced by lpszNew.
pwszNew:  A pointer to a string containing the character replacing lpszOld.
Returns: The number of replaced instances of the substring.
Zero if the string is not changed.

AcString.op_Assign(std.basic_string&lt;System.Char,std.char_traits{System.Char},std.allocator&lt;System.Char&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Initialize this AcString from a std::wstring.
csw: input reference to the std::wstring
Returns: A reference to this AcString object.

AcString.#ctor(std.basic_string&lt;System.Char,std.char_traits{System.Char},std.allocator&lt;System.Char&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Construct an AcString from a std::wstring.
csw: input reference to the std::wstring

AcString.spanExcluding(System.Char!System.Runtime.CompilerServices.IsConst*)
Extract substring up to the first instance of a designated character.
pwszChars:  Null terminated string of chars at which to stop scanning
Returns:  AcString that contains the substring

AcString.remove
Remove all occurrences of whitespace.
Returns:  Number of characters removed. Zero if the string was not changed.

AcString.remove(System.Char)
Remove all occurrences of the specified character.
Returns:  Number of characters removed. Zero if the string was not changed.
Remarks:  Removes whitespace characters if wch arg is zero.

AcString.trim(System.Char!System.Runtime.CompilerServices.IsConst*)
Remove all designated characters from both ends of the string.
Returns:  Reference to this AcString.
Remarks:  Trims whitespace if pwszChars arg is null.

AcString.trim
Remove all whitespace characters from both ends of the string.
Returns:  Reference to this AcString.

AcString.trimRight(System.Char!System.Runtime.CompilerServices.IsConst*)
Remove all designated characters from the end of the string.
Returns:  Reference to this AcString.
Remarks:  Trims whitespace if pwszChars arg is null.

AcString.trimRight
Remove all whitespace characters from the end of the string.
Returns:  Reference to this AcString.

AcString.trimLeft(System.Char!System.Runtime.CompilerServices.IsConst*)
Remove all designated characters from beginning of the string.
Returns:  Reference to this AcString.
Remarks:  Trims whitespace if pwszChars arg is null.

AcString.trimLeft
Remove all whitespace characters from beginning of the string.
Returns:  Reference to this AcString.

AcString.trim(System.Char)
Remove all occurrences of a character from both ends of this string.
Returns:  Reference to this AcString.
Remarks:  No-op if wch arg is null character.

AcString.trimRight(System.Char)
Remove all occurrences of a character from end of this string.
Returns:  Reference to this AcString.
Remarks:  No-op if wch arg is null character.

AcString.trimLeft(System.Char)
Remove all occurrences of a character from front of this string.
Returns:  Reference to this AcString.
Remarks:  No-op if wch arg is null character.

AcString.makeReverse
Reverse the characters in this string.///
Returns: A reference to this AcString.

AcString.makeLower
Convert this string's uppercase characters to lower case.
Returns:  Reference to this AcString.

AcString.makeUpper
Convert this string's lowercase characters to upper case.
Returns:  Reference to this AcString.

AcString.matchNoCase(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
See how many characters case-independently match another AcString.
acs: input reference to the other AcString
Returns: The number of characters that match acs.

AcString.matchNoCase(System.Char!System.Runtime.CompilerServices.IsConst*)
See how many characters case-independently match a wide string.
pwsz: input pointer to the string of characters
Returns: The number of characters that match pwsz.

AcString.matchNoCase(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,AcString.Encoding)
See how many characterss case-independently match a narrow string.
psz: input pointer to the string of narrow chars
encoding: input Encoding type
Returns: The number of characters that match psz.
Remarks: Currently, only Utf8 encoding is supported.

AcString.match(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
See how many characters match another AcString.
acs: input reference to the other AcString
Returns: The number of characters that match pwsz.

AcString.match(System.Char!System.Runtime.CompilerServices.IsConst*)
See how many characters match a string of wide characters.
pwsz: input pointer to the string of characters
Returns: The number of characters that match pwsz.

AcString.match(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,AcString.Encoding)
See how many characters match a string of narrow chars.
psz: input pointer to the string of narrow chars
encoding: input Encoding type
Returns: The number of characters that match psz.
Remarks: Currently, only Utf8 encoding is supported.

AcString.op_LessThanOrEqual(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Compare the string for less or equal to than another AcString.
acs: input reference to the other AcString
Returns: True if this string is less than or equal to acs, false otherwise.

AcString.op_LessThanOrEqual(System.Char!System.Runtime.CompilerServices.IsConst*)
Compare the string for less than/equal to a string of wide characters.
pwsz: input pointer to the string of characters
Returns: True if this string is less than or equal to pwsz, false otherwise.

AcString.op_LessThanOrEqual(System.Char)
Compare the string for less than or equal to a wide char.
wch: input character to compare to
Returns: True if this string is less than or equal to wch, false otherwise.

AcString.op_LessThan(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Compare the string for less than another AcString.
acs: input reference to the other AcString
Returns: True if this string is less than acs, false otherwise.

AcString.op_LessThan(System.Char!System.Runtime.CompilerServices.IsConst*)
Compare the string for less than a string of wide characters.
pwsz: input pointer to the string of characters to compare to
Returns: True if this string is less than pwsz, false otherwise.

AcString.op_LessThan(System.Char)
Compare the string for less than a wide char.
wch: input character to compare to
Returns: True if this string is less than wch, false otherwise.

AcString.op_GreaterThanOrEqual(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Compare the string for greater than or equal to another AcString.
acs: input reference to the other AcString
Returns: True if this string is greater than or equal to acs, false otherwise.

AcString.op_GreaterThanOrEqual(System.Char!System.Runtime.CompilerServices.IsConst*)
Compare for greater than/equal to a string of wide characters.
pwsz: input pointer to the string of characters
Returns: True if this string is greater than or equal to pwsz, false otherwise.

AcString.op_GreaterThanOrEqual(System.Char)
Compare the string for greater than or equal to a wide char.
wch: input character to compare to
Returns: True if this string is greater than or equal to wch, false otherwise.

AcString.op_GreaterThan(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Compare the string for greater than another AcString.
acs: input reference to the other AcString
Returns: True if this string is greater than acs, false otherwise.

AcString.op_GreaterThan(System.Char!System.Runtime.CompilerServices.IsConst*)
Compare the string for greater than a string of wide characters.
pwsz: input pointer to the string of characters to compare to
Returns: True if this string is greater than pwsz, false otherwise.

AcString.op_GreaterThan(System.Char)
Compare the string for greater than a wide char.
wch: input character to compare to
Returns: True if this string is greater than wch, false otherwise.

AcString.op_Inequality(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Compare the string for non-equality with another AcString.
acs: input reference to the other AcString
Returns: True if this string does not equal acs, false if they are equal.

AcString.op_Inequality(System.Char!System.Runtime.CompilerServices.IsConst*)
Compare the string for non-equality with a string of wide characters.
pwsz: input pointer to the string of characters
Returns: True if this string does not equal pwsz, false if they are equal.

AcString.op_Inequality(System.Char)
Compare the string for non-equality with a wide char.
wch: input character to compare to
Returns: True if this string does not equal wch, false if they are equal.

AcString.op_Equality(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Compare the string for equality with another AcString.
acs: input reference to the other AcString
Returns: True if this string equals acs, else false.

AcString.op_Equality(System.Char!System.Runtime.CompilerServices.IsConst*)
Compare the string for equality with a string of wide characters.
pwsz: input pointer to the string of characters
Returns: True if this string equals pwsz, else false.

AcString.op_Equality(System.Char)
Compare this string for equality with a wide char.
wch: input character to compare to
Returns: True if this string equals wch, else false.

AcString.equalsNoCase(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Compares two AcStrings for equality, ignoring case.
left:  one AcString object
right:  another AcString object
Returns: true if left equals right, else false.
Remarks: May be useful as a comparator function for STL functions.

AcString.precat(System.Char!System.Runtime.CompilerServices.IsConst*)
Copy the string and insert a string of characters in front of it.
psz: input pointer to the string of characters to insert
Returns: A reference to this string object.

AcString.precat(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,AcString.Encoding)
Copy the string and insert a string of narrow chars in front of it.
psz: input pointer to the string of narrow chars to insert
encoding: input Encoding type
Returns: A reference to this string object.
Remarks: Currently, only Utf8 encoding is supported.

AcString.precat(System.Char)
Copy the string and insert a character in front of it.
ch: input character to insert
Returns: A reference to this string object.

AcString.concat(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Copy the string and append an AcString to it.
pwsz: input reference to the AcString to append
Returns: A reference to this string object.

AcString.concat(System.Char!System.Runtime.CompilerServices.IsConst*)
Copy the string and append a string of Unicode characters to it.
pwsz: input pointer to the string to append
Returns: A reference to this string object.

AcString.concat(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,AcString.Encoding)
Copy the string and append a string of narrow chars to it.
psz: input pointer to the narrow string to append
encoding: input Encoding type
Returns: A reference to this string object.
Remarks: Currently, only Utf8 encoding is supported.

AcString.concat(System.Char)
Copy the string and append a Unicode character to it.
ch: input character to append to the string copy
Returns: A reference to this string object.

AcString.op_Addition(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Copy the string and append an AcString to it.
pwsz: input reference to the AcString to append
Returns: A reference to this string object.

AcString.op_Addition(System.Char!System.Runtime.CompilerServices.IsConst*)
Copy the string and append a string of Unicode characters to it.
pwsz: input pointer to the string to append
Returns: A reference to this string object.

AcString.op_Addition(System.Char)
Copy the string and append a Unicode character to it.
ch: input character to append to the string copy
Returns: A reference to this string object.

AcString.append(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
append an AcString object to the end of the string.
acs: input reference to the AcString
Returns: A reference to this string object.

AcString.append(System.Char!System.Runtime.CompilerServices.IsConst*)
append a Unicode string to the end of the string.
pwsz: input pointer to the Unicode string
Returns: A reference to this string object.

AcString.append(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,AcString.Encoding)
append a char string to the end of the string.
psz: input pointer to the narrow char string
encoding: input Encoding type
Returns: A reference to this string object.
Remarks: Currently, only Utf8 encoding is supported.

AcString.append(System.Char)
append a Unicode character to the end of the string.
wch: input character to append
Returns: A reference to this string object.

AcString.op_AdditionAssignment(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
append an AcString object to the end of the string.
acs: input reference to the AcString
Returns: A reference to this string object.

AcString.op_AdditionAssignment(System.Char!System.Runtime.CompilerServices.IsConst*)
append a Unicode string to the end of the string.
pwsz: input pointer to the Unicode string
Returns: A reference to this string object.

AcString.op_AdditionAssignment(System.Char)
append a Unicode character to the end of the string.
wch: input character to append
Returns: A reference to this string object.

AcString.appendFormat(System.Char!System.Runtime.CompilerServices.IsConst*,BTEllipsis)
Append formated data to this string using "printf" rules
pszFmt: input pointer to the printf format string
args: input variable args list, containing values to be formatted
Returns:  Reference to this AcString.

AcString.formatV(System.Char!System.Runtime.CompilerServices.IsConst*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
Format the string using "printf" rules.
pszFmt: input pointer to the printf format string
args: input variable args list, containing values to be formatted
Returns: A reference to this string object.

AcString.format(System.Char!System.Runtime.CompilerServices.IsConst*,BTEllipsis)
Format the string using "printf" rules..
pszFmt: input pointer to the printf format string
Returns: A reference to this string object.

AcString.loadString(AcRxResourceInstance!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt32)
Set the string from a resource string.
hDll: AxResourceInstance object to load string
nId: input id of the string resource in the specified resource dll
Returns: A reference to this string object.

AcString.setEmpty
Set the string to be empty..
Returns: A reference to this string object.

AcString.op_Assign(AcDbHandle!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
assign an AcDbHandle object to the string (format it as hex).
h: input reference to the AcDbHandle object
Returns: A reference to this string object.

AcString.op_Assign(AcString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
move a temp AcString object to the string.
acs: input reference to the temp AcString
Returns: A reference to this string object.

AcString.op_Assign(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
assign an AcString object to the string.
acs: input reference to the AcString
Returns: A reference to this string object.

AcString.op_Assign(System.Char!System.Runtime.CompilerServices.IsConst*)
assign a string of Unicode characters to the string.
pwsz: input pointer to the string of characters to assign
Returns: A reference to this string object.

AcString.op_Assign(System.Char)
assign a Unicode character to the string.
wch: input character to assign
Returns: A reference to this string object.

AcString.assign(AcDbHandle!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
assign an AcDbHandle object to the string (format it as hex).
h: input reference to the AcDbHandle object
Returns: A reference to this string object.

AcString.assign(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
assign an AcString object to the string.
acs: input reference to the AcString
Returns: A reference to this string object.

AcString.assign(System.Char!System.Runtime.CompilerServices.IsConst*)
assign a string of Unicode characters to the string.
pwsz: input pointer to the string of characters to assign
Returns: A reference to this string object.

AcString.assign(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,AcString.Encoding)
assign a string of narrow chars to the string.
psz: input pointer to the string of narrow chars to assign
encoding:  input Encoding type
Returns: A reference to this string object.
Remarks: Currently, only Utf8 encoding is supported.

AcString.assign(System.Char)
assign a Unicode character to the string.
wch: input character to assign
Returns: A reference to this string object.

AcString.right(System.Int32)
Return a nNumChars length substring from the end of string.
nNumChars: The count of characters of the substring to get.
Returns: An AcString consisting of the specified substring

AcString.left(System.Int32)
Return a nNumChars length substring from the start of string.
nNumChars: The count of characters of the substring to get.
Returns: An AcString consisting of the specified substring

AcString.substrRev(System.Int32)
Get a substring from the end of string..
nNumChars: input number of characters to retrieve.
Returns: An AcString consisting of the specified substring

AcString.substr(System.Int32,System.Int32)
Get a substring from the string.  (same as mid() method).
nStart: input 0-based index from the start of the string
nNumChars: input number of characters to retrieve.
Returns: An AcString consisting of the specified substring

AcString.substr(System.Int32)
Get a substring from the start of string..
nNumChars: input number of characters to retrieve.
Returns: An AcString consisting of the specified substring

AcString.mid(System.Int32)
Get substring from the a specified position to the string's end.
nStart: The zero-based start position of the substring to get.
Returns: An AcString consisting of the specified substring

AcString.findLastNoneOf(System.Char!System.Runtime.CompilerServices.IsConst*,System.Int32)
Find last character in this string which does not match any in a group
of characters
psz: input group of characters to search for
nEndPos: first character position to look at
Returns:  The position of the "not found" character. -1 if all were found.
Remarks:  If psz is null, then we search for whitespace.

AcString.findLastOneOf(System.Char!System.Runtime.CompilerServices.IsConst*,System.Int32)
Find last character in this string from a group of characters
psz: input group of characters to match
nEndPos: Last character position to look at
Returns:  The position of the found character. -1 if not found.
Remarks:  If psz is null, then we search for whitespace.

AcString.findLast(System.Char!System.Runtime.CompilerServices.IsConst*,System.Int32)
Find last occurrence of a substring in the string
psz: input substring to search for
nEndPos: Last character position to look at
Returns:  The position of the found substring result. -1 if not found.

AcString.findLast(System.Char,System.Int32)
Find last occurrence of a character in the string
ch: input character to search for
nEndPos: Last character position to look at
Returns:  The position of the found character. -1 if not found.

AcString.findOneOfRev(System.Char!System.Runtime.CompilerServices.IsConst*)
Find last character in this string from a group of characters
psz: input group of characters to match
Returns:  The position of the found character. -1 if not found.
Remarks:  This method is DEPRECATED. Please use findLast() instead.

AcString.findRev(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Find last occurrence of a substring in the string
acs: input substring to search for
Returns:  The position of the found substring result. -1 if not found.
Remarks:  This method is DEPRECATED. Please use findLast() instead.

AcString.findRev(System.Char!System.Runtime.CompilerServices.IsConst*)
Find last occurrence of a substring in the string
psz: input substring to search for
Returns:  The position of the found substring result. -1 if not found.
Remarks:  This method is DEPRECATED. Please use findLast() instead.

AcString.findRev(System.Char)
Find last occurrence of a character in the string
ch: input character to search for
Returns:  The position of the found character. -1 if not found.
Remarks:  This method is DEPRECATED. Please use findLast() instead.

AcString.findNoneOf(System.Char!System.Runtime.CompilerServices.IsConst*,System.Int32)
Find first character in this string which does not match any in a group
of input characters
psz: input group of characters to search for
nStartPos: first character position to look at
Returns:  The position of the "not found" character. -1 if all were found.
Remarks:  If psz is null, then we search for whitespace.

AcString.findOneOf(System.Char!System.Runtime.CompilerServices.IsConst*,System.Int32)
Find first character in this string which matches any in a group of
input characters
psz: input group of characters to search for
nStartPos: first character position in this string to look at
Returns:  The position of the found character. -1 if not found.
Remarks:  If psz is null, then we search for whitespace.

AcString.find(System.Char!System.Runtime.CompilerServices.IsConst*,System.Int32)
Find a substring in the string
psz: input string to search for
nStartPos: first character position in this string to look at
Returns:  The position of the found substring. -1 if not found.

AcString.find(System.Char,System.Int32)
Find a single character in the string.
ch: input character to search for
nStartPos: first character position to look at
Returns:  The position of the found character. -1 if not found.

AcString.find(System.Char)
Find a single character in the string..
ch: input character to search for
Returns: The position of the found character. -1 if not found.
Remarks: The first character position is zero.

AcString.asAcDbHandle(System.Int32)
Parse the current string as hexadecimal.  Return the handle..
nFlags: input bits specifying how to do the parsing
Returns: The handle value parsed from the string.

AcString.asUHex64(System.Int32)
Parse the current string as hexadecimal, return an unsigned int64.
nFlags: input bits specifying how to do the parsing
Returns: The int value parsed from the string.

AcString.asUDeci64(System.Int32)
Parse the current string as decimal, return an unsigned int64.
nFlags: input bits specifying how to do the parsing
Returns: The int value parsed from the string.

AcString.asHex64(System.Int32)
Parse the current string as hexadecimal, return a signed int64.
nFlags: input bits specifying how to do the parsing
Returns: The int value parsed from the string.

AcString.asDeci64(System.Int32)
Parse the current string as decimal, return a signed int64.
nFlags: input bits specifying how to do the parsing
Returns: The int value parsed from the string.

AcString.asUHex(System.Int32)
Parse the current string as hexadecimal, return an unsigned int.
nFlags: input bits specifying how to do the parsing
Returns: The int value parsed from the string.

AcString.asUDeci(System.Int32)
Parse the current string as decimal, return an unsigned int.
nFlags: input bits specifying how to do the parsing
Returns: The int value parsed from the string.

AcString.asHex(System.Int32)
Parse the current string as hexadecimal, return a signed int.
nFlags: input bits specifying how to do the parsing
Returns: The int value parsed from the string.

AcString.asDeci(System.Int32)
Parse the current string as decimal, return a signed int.
nFlags: input bits specifying how to do the parsing
Returns: The int value parsed from the string.

AcString.is7Bit
Check if all characters are in the range 0x01 through 0x7f.
Returns: True if all characters have their high bit (0x80) clear.
Remarks: Codes in 0x01 through 0x7f tend to have the same meaning across
all encoding schemes (ansi code pages, utf-8, utf-16, etc.

AcString.isAscii
Check if all characters are in the ascii range: 0x20..0x7f.
Returns: True if all characters in the ASCII range, else false.
Remarks: Codes 0x..0x1f are considered control characters and cause this method
to return false, for historical reasons.

AcString.reserve(System.UInt32)
Grows or (possibly) shrinks the buffer to match the requested capacity .
nCapacity: Number of characters of space needed, including terminator.
Returns: True if the buffer was re-allocated, else false.
Remarks: Shrink requests may be ignored, depending on current buffer size,
string length and refcount.

AcString.tcharLength
Get logical length of this string.
Returns: The number of characters in the string. Zero if it's empty.
Remarks: This method is dDeprecated. Please use length() instead.

AcString.length
Get logical length of this string.
Returns: The number of characters in the string. Zero if it's empty.
Remarks: Null terminator is not counted in logical length.

AcString.isEmpty
Test whether this string is null, i.e. has logical length zero.
Returns: True if the string is empty, else false.

AcString.utf8Ptr
Get the string as utf-8.
Returns: A pointer to a null-terminated utf8 string.
Remarks:  The pointer is only valid until this object is next modified.
Warning: this method can modify the object, even though it is const

AcString.#ctor(AcRxResourceInstance!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt32)
Load String from resource instance.
hDll: AxResourceInstance object to load string
nId: input id of the string resource in the specified resource dll

AcString.#ctor(AcDbHandle!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Formats an AcDbHandle value in hex, as in: "a2f".
h: input reference to an acdb handle value

AcString.#ctor(System.Char,System.UInt32)
repeat a character n times.
ch: character value
nRepeatTimes: repate times

AcString.#ctor(AcString.eFormat,System.UInt32)
Multi-purpose constructor, takes an unsigned argument and
uses it either to load a resource string or to create a
numerical string (base 10 or hex).
nCtorFlags: input flags, indicating type of construction
nArg: input argument value, interpreted according to flags

AcString.#ctor(AcString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Move constructor
acs: input reference to an existing temp AcString object

AcString.#ctor(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Copy constructor
acs: input reference to an existing AcString object

AcString.#ctor(System.Char!System.Runtime.CompilerServices.IsConst*,System.UInt32)
Initialize from a Unicode string
wpsz: input pointer to source
count:  number of characters to use from the input string

AcString.#ctor(System.Char!System.Runtime.CompilerServices.IsConst*)
Initialize from a Unicode string
wpsz: input pointer to zero terminated source string

AcString.#ctor(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,AcString.Encoding)
Initialize from a narrow char string.
psz: Input narrow string. Null terminated.
encoding:  Input string's encoding format.
Remarks: Currently, only Utf8 encoding is supported.

AcString.#ctor(System.Char)
Initialize with a single Unicode character
wch: input character

AcString.#ctor
Default ctor, initializes to empty string.